hpmicro/hpm_sdk/soc/HPM6P00/ip/hpm_lobs_regs.h
/*
 * Copyright (c) 2021-2025 HPMicro
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */


#ifndef HPM_LOBS_H
#define HPM_LOBS_H

typedef struct {
    __RW uint32_t CTRL;                        /* 0x0: Control Register */
    __R  uint8_t  RESERVED0[8];                /* 0x4 - 0xB: Reserved */
    __RW uint32_t STREAMCTRL;                  /* 0xC: Stream Control Register */
    __RW uint32_t PTACTION;                    /* 0x10: Pre-trigger Action Register */
    __RW uint32_t STARTADDR;                   /* 0x14: Start Address Register */
    __RW uint32_t ENDADDR;                     /* 0x18: End Address Register */
    __R  uint8_t  RESERVED1[4];                /* 0x1C - 0x1F: Reserved */
    __R  uint32_t CTSR;                        /* 0x20: Current Trigger State Register */
    __R  uint32_t CCVR;                        /* 0x24: Current Counter Value Register */
    __R  uint32_t CAVR;                        /* 0x28: Current Action Value Register */
    __R  uint8_t  RESERVED2[4];                /* 0x2C - 0x2F: Reserved */
    __R  uint32_t FIFOSTATE;                   /* 0x30: Fifo State Register */
    __RW uint32_t FINALADDR;                   /* 0x34: Final Address Register */
    __R  uint8_t  RESERVED3[24];               /* 0x38 - 0x4F: Reserved */
    __RW uint32_t GRPSELA;                     /* 0x50: Group Select Register */
    __RW uint32_t GRPENA;                      /* 0x54: Group Enable Register */
    __RW uint32_t SIGSELA1;                    /* 0x58: Signal Select1 Register */
    __R  uint8_t  RESERVED4[4];                /* 0x5C - 0x5F: Reserved */
    __RW uint32_t SIGSELA2;                    /* 0x60: Signal Select2 Register */
    __R  uint8_t  RESERVED5[52];               /* 0x64 - 0x97: Reserved */
    __RW uint32_t SIGENA;                      /* 0x98: Signal Enable Register */
    __R  uint8_t  RESERVED6[100];              /* 0x9C - 0xFF: Reserved */
    struct {
        __RW uint32_t SIGSEL;                  /* 0x100: Signal Select Register */
        __RW uint32_t TRIGCTRL;                /* 0x104: Trigger Control Register */
        __RW uint32_t NEXTSTATE;               /* 0x108: Next State Register */
        __RW uint32_t ACTION;                  /* 0x10C: Action Register */
        __R  uint8_t  RESERVED0[16];           /* 0x110 - 0x11F: Reserved */
        __RW uint32_t COUNTCOMP;               /* 0x120: Counter Compare Register */
        __R  uint8_t  RESERVED1[12];           /* 0x124 - 0x12F: Reserved */
        __RW uint32_t EXTMASK;                 /* 0x130: External Mask Register */
        __RW uint32_t EXTCOMP;                 /* 0x134: External Compare Register */
        __R  uint8_t  RESERVED2[8];            /* 0x138 - 0x13F: Reserved */
        __RW uint32_t SIGMASK;                 /* 0x140: Signal Mask Register */
        __RW uint32_t COMPEN;                  /* 0x144: Compare Enable register */
        __R  uint8_t  RESERVED3[56];           /* 0x148 - 0x17F: Reserved */
        __RW uint32_t SIGCOMP0;                /* 0x180: Signal Compare Register0 */
        __RW uint32_t SIGCOMP1;                /* 0x184: Signal Compare Register1 */
        __RW uint32_t SIGCOMP2;                /* 0x188: Signal Compare Register2 */
        __RW uint32_t SIGCOMP3;                /* 0x18C: Signal Compare Register3 */
        __R  uint8_t  RESERVED4[112];          /* 0x190 - 0x1FF: Reserved */
    } STATE[5];
    __R  uint8_t  RESERVED7[2480];             /* 0x600 - 0xFAF: Reserved */
    __RW uint32_t LAR;                         /* 0xFB0: Lock Access Register */
} LOBS_Type;


/* Bitfield definition for register: CTRL */
/*
 * RUN (RW)
 *
 * Run control.
 * 0 LOBS disabled. Register programming permitted.
 * 1 LOBS enabled
 */
#define LOBS_CTRL_RUN_MASK (0x1U)
#define LOBS_CTRL_RUN_SHIFT (0U)
#define LOBS_CTRL_RUN_SET(x) (((uint32_t)(x) << LOBS_CTRL_RUN_SHIFT) & LOBS_CTRL_RUN_MASK)
#define LOBS_CTRL_RUN_GET(x) (((uint32_t)(x) & LOBS_CTRL_RUN_MASK) >> LOBS_CTRL_RUN_SHIFT)

/* Bitfield definition for register: STREAMCTRL */
/*
 * SEL (RW)
 *
 * Signal Group Select
 * 0 128bit from one group
 * 1 from 2 groups, 4bit in each group
 */
#define LOBS_STREAMCTRL_SEL_MASK (0x100U)
#define LOBS_STREAMCTRL_SEL_SHIFT (8U)
#define LOBS_STREAMCTRL_SEL_SET(x) (((uint32_t)(x) << LOBS_STREAMCTRL_SEL_SHIFT) & LOBS_STREAMCTRL_SEL_MASK)
#define LOBS_STREAMCTRL_SEL_GET(x) (((uint32_t)(x) & LOBS_STREAMCTRL_SEL_MASK) >> LOBS_STREAMCTRL_SEL_SHIFT)

/*
 * FULL_CLEAR (RW)
 *
 * FIFO Overflow Clear
 */
#define LOBS_STREAMCTRL_FULL_CLEAR_MASK (0x80U)
#define LOBS_STREAMCTRL_FULL_CLEAR_SHIFT (7U)
#define LOBS_STREAMCTRL_FULL_CLEAR_SET(x) (((uint32_t)(x) << LOBS_STREAMCTRL_FULL_CLEAR_SHIFT) & LOBS_STREAMCTRL_FULL_CLEAR_MASK)
#define LOBS_STREAMCTRL_FULL_CLEAR_GET(x) (((uint32_t)(x) & LOBS_STREAMCTRL_FULL_CLEAR_MASK) >> LOBS_STREAMCTRL_FULL_CLEAR_SHIFT)

/*
 * SAMPLE (RW)
 *
 * Sample Rate
 * 4 take one every 5
 * 5 take one every 6
 * 6 take one every 7
 */
#define LOBS_STREAMCTRL_SAMPLE_MASK (0x78U)
#define LOBS_STREAMCTRL_SAMPLE_SHIFT (3U)
#define LOBS_STREAMCTRL_SAMPLE_SET(x) (((uint32_t)(x) << LOBS_STREAMCTRL_SAMPLE_SHIFT) & LOBS_STREAMCTRL_SAMPLE_MASK)
#define LOBS_STREAMCTRL_SAMPLE_GET(x) (((uint32_t)(x) & LOBS_STREAMCTRL_SAMPLE_MASK) >> LOBS_STREAMCTRL_SAMPLE_SHIFT)

/*
 * BURST (RW)
 *
 * Burst Cfg
 * 3b011 Incr4
 * 3b101 Incr8
 * 3b111 Incr16
 */
#define LOBS_STREAMCTRL_BURST_MASK (0x7U)
#define LOBS_STREAMCTRL_BURST_SHIFT (0U)
#define LOBS_STREAMCTRL_BURST_SET(x) (((uint32_t)(x) << LOBS_STREAMCTRL_BURST_SHIFT) & LOBS_STREAMCTRL_BURST_MASK)
#define LOBS_STREAMCTRL_BURST_GET(x) (((uint32_t)(x) & LOBS_STREAMCTRL_BURST_MASK) >> LOBS_STREAMCTRL_BURST_SHIFT)

/* Bitfield definition for register: PTACTION */
/*
 * TRACE (RW)
 *
 * Enables trace
 */
#define LOBS_PTACTION_TRACE_MASK (0x8U)
#define LOBS_PTACTION_TRACE_SHIFT (3U)
#define LOBS_PTACTION_TRACE_SET(x) (((uint32_t)(x) << LOBS_PTACTION_TRACE_SHIFT) & LOBS_PTACTION_TRACE_MASK)
#define LOBS_PTACTION_TRACE_GET(x) (((uint32_t)(x) & LOBS_PTACTION_TRACE_MASK) >> LOBS_PTACTION_TRACE_SHIFT)

/* Bitfield definition for register: STARTADDR */
/*
 * ADDR (RW)
 *
 * Start address
 */
#define LOBS_STARTADDR_ADDR_MASK (0xFFFFFFFFUL)
#define LOBS_STARTADDR_ADDR_SHIFT (0U)
#define LOBS_STARTADDR_ADDR_SET(x) (((uint32_t)(x) << LOBS_STARTADDR_ADDR_SHIFT) & LOBS_STARTADDR_ADDR_MASK)
#define LOBS_STARTADDR_ADDR_GET(x) (((uint32_t)(x) & LOBS_STARTADDR_ADDR_MASK) >> LOBS_STARTADDR_ADDR_SHIFT)

/* Bitfield definition for register: ENDADDR */
/*
 * ADDR (RW)
 *
 * End address
 */
#define LOBS_ENDADDR_ADDR_MASK (0xFFFFFFFFUL)
#define LOBS_ENDADDR_ADDR_SHIFT (0U)
#define LOBS_ENDADDR_ADDR_SET(x) (((uint32_t)(x) << LOBS_ENDADDR_ADDR_SHIFT) & LOBS_ENDADDR_ADDR_MASK)
#define LOBS_ENDADDR_ADDR_GET(x) (((uint32_t)(x) & LOBS_ENDADDR_ADDR_MASK) >> LOBS_ENDADDR_ADDR_SHIFT)

/* Bitfield definition for register: CTSR */
/*
 * FINALSTATE (RO)
 *
 * 0 LOBS is still tracing.
 * 1 Indicates that the LOBS has stopped advancing Trigger States and stopped trace.
 * FINALSTATE can be set by TRIGCTRL.COUNTBRK reaching the final loop count, or by programming NEXTSTATEto zero
 */
#define LOBS_CTSR_FINALSTATE_MASK (0x80000000UL)
#define LOBS_CTSR_FINALSTATE_SHIFT (31U)
#define LOBS_CTSR_FINALSTATE_GET(x) (((uint32_t)(x) & LOBS_CTSR_FINALSTATE_MASK) >> LOBS_CTSR_FINALSTATE_SHIFT)

