hpmicro/hpm_sdk/soc/HPM6P00/ip/hpm_lobs_regs.h
/*
 * CTSR (RO)
 *
 * Reads current Trigger State. This is a one-hot encoded field.
 * When CTRL.RUN:
 * 0 RAZ.
 * 1 Returns current Trigger State.
 * If FINALSTATE is 1, then the CTSR field gives the Trigger State when FINALSTATE became 1
 */
#define LOBS_CTSR_CTSR_MASK (0x1FU)
#define LOBS_CTSR_CTSR_SHIFT (0U)
#define LOBS_CTSR_CTSR_GET(x) (((uint32_t)(x) & LOBS_CTSR_CTSR_MASK) >> LOBS_CTSR_CTSR_SHIFT)

/* Bitfield definition for register: CCVR */
/*
 * CCVR (RO)
 *
 * Returns the counter value when the CTSR was last read. If the CTSR has never been read, then the value in the CCVR is undefined
 */
#define LOBS_CCVR_CCVR_MASK (0xFFFFFFFFUL)
#define LOBS_CCVR_CCVR_SHIFT (0U)
#define LOBS_CCVR_CCVR_GET(x) (((uint32_t)(x) & LOBS_CCVR_CCVR_MASK) >> LOBS_CCVR_CCVR_SHIFT)

/* Bitfield definition for register: CAVR */
/*
 * TRACE (RO)
 *
 * Trace active.
 * 0b0 Trace is not active.
 * 0b1 Trace is active.
 */
#define LOBS_CAVR_TRACE_MASK (0x8U)
#define LOBS_CAVR_TRACE_SHIFT (3U)
#define LOBS_CAVR_TRACE_GET(x) (((uint32_t)(x) & LOBS_CAVR_TRACE_MASK) >> LOBS_CAVR_TRACE_SHIFT)

/* Bitfield definition for register: FIFOSTATE */
/*
 * FULL (RO)
 *
 * FIFO full
 */
#define LOBS_FIFOSTATE_FULL_MASK (0x2U)
#define LOBS_FIFOSTATE_FULL_SHIFT (1U)
#define LOBS_FIFOSTATE_FULL_GET(x) (((uint32_t)(x) & LOBS_FIFOSTATE_FULL_MASK) >> LOBS_FIFOSTATE_FULL_SHIFT)

/*
 * EMPTY (RO)
 *
 * FIFO empty
 */
#define LOBS_FIFOSTATE_EMPTY_MASK (0x1U)
#define LOBS_FIFOSTATE_EMPTY_SHIFT (0U)
#define LOBS_FIFOSTATE_EMPTY_GET(x) (((uint32_t)(x) & LOBS_FIFOSTATE_EMPTY_MASK) >> LOBS_FIFOSTATE_EMPTY_SHIFT)

/* Bitfield definition for register: FINALADDR */
/*
 * ADDR (RW)
 *
 * Final address
 */
#define LOBS_FINALADDR_ADDR_MASK (0xFFFFFFFFUL)
#define LOBS_FINALADDR_ADDR_SHIFT (0U)
#define LOBS_FINALADDR_ADDR_SET(x) (((uint32_t)(x) << LOBS_FINALADDR_ADDR_SHIFT) & LOBS_FINALADDR_ADDR_MASK)
#define LOBS_FINALADDR_ADDR_GET(x) (((uint32_t)(x) & LOBS_FINALADDR_ADDR_MASK) >> LOBS_FINALADDR_ADDR_SHIFT)

/* Bitfield definition for register: GRPSELA */
/*
 * NUM2 (RW)
 *
 * Select sample group number2
 */
#define LOBS_GRPSELA_NUM2_MASK (0xF0U)
#define LOBS_GRPSELA_NUM2_SHIFT (4U)
#define LOBS_GRPSELA_NUM2_SET(x) (((uint32_t)(x) << LOBS_GRPSELA_NUM2_SHIFT) & LOBS_GRPSELA_NUM2_MASK)
#define LOBS_GRPSELA_NUM2_GET(x) (((uint32_t)(x) & LOBS_GRPSELA_NUM2_MASK) >> LOBS_GRPSELA_NUM2_SHIFT)

/*
 * NUM1 (RW)
 *
 * Select sample group number1
 */
#define LOBS_GRPSELA_NUM1_MASK (0xFU)
#define LOBS_GRPSELA_NUM1_SHIFT (0U)
#define LOBS_GRPSELA_NUM1_SET(x) (((uint32_t)(x) << LOBS_GRPSELA_NUM1_SHIFT) & LOBS_GRPSELA_NUM1_MASK)
#define LOBS_GRPSELA_NUM1_GET(x) (((uint32_t)(x) & LOBS_GRPSELA_NUM1_MASK) >> LOBS_GRPSELA_NUM1_SHIFT)

/* Bitfield definition for register: GRPENA */
/*
 * EN2 (RW)
 *
 * Enable sample group number2
 */
#define LOBS_GRPENA_EN2_MASK (0x2U)
#define LOBS_GRPENA_EN2_SHIFT (1U)
#define LOBS_GRPENA_EN2_SET(x) (((uint32_t)(x) << LOBS_GRPENA_EN2_SHIFT) & LOBS_GRPENA_EN2_MASK)
#define LOBS_GRPENA_EN2_GET(x) (((uint32_t)(x) & LOBS_GRPENA_EN2_MASK) >> LOBS_GRPENA_EN2_SHIFT)

/*
 * EN1 (RW)
 *
 * Enable sample group number1
 */
#define LOBS_GRPENA_EN1_MASK (0x1U)
#define LOBS_GRPENA_EN1_SHIFT (0U)
#define LOBS_GRPENA_EN1_SET(x) (((uint32_t)(x) << LOBS_GRPENA_EN1_SHIFT) & LOBS_GRPENA_EN1_MASK)
#define LOBS_GRPENA_EN1_GET(x) (((uint32_t)(x) & LOBS_GRPENA_EN1_MASK) >> LOBS_GRPENA_EN1_SHIFT)

/* Bitfield definition for register: SIGSELA1 */
/*
 * NUM4 (RW)
 *
 * Select sample signal bit number4 in first group
 */
#define LOBS_SIGSELA1_NUM4_MASK (0xFF000000UL)
#define LOBS_SIGSELA1_NUM4_SHIFT (24U)
#define LOBS_SIGSELA1_NUM4_SET(x) (((uint32_t)(x) << LOBS_SIGSELA1_NUM4_SHIFT) & LOBS_SIGSELA1_NUM4_MASK)
#define LOBS_SIGSELA1_NUM4_GET(x) (((uint32_t)(x) & LOBS_SIGSELA1_NUM4_MASK) >> LOBS_SIGSELA1_NUM4_SHIFT)

/*
 * NUM3 (RW)
 *
 * Select sample signal bit number3 in first group
 */
#define LOBS_SIGSELA1_NUM3_MASK (0xFF0000UL)
#define LOBS_SIGSELA1_NUM3_SHIFT (16U)
#define LOBS_SIGSELA1_NUM3_SET(x) (((uint32_t)(x) << LOBS_SIGSELA1_NUM3_SHIFT) & LOBS_SIGSELA1_NUM3_MASK)
#define LOBS_SIGSELA1_NUM3_GET(x) (((uint32_t)(x) & LOBS_SIGSELA1_NUM3_MASK) >> LOBS_SIGSELA1_NUM3_SHIFT)

/*
 * NUM2 (RW)
 *
 * Select sample signal bit number2 in first group
 */
#define LOBS_SIGSELA1_NUM2_MASK (0xFF00U)
#define LOBS_SIGSELA1_NUM2_SHIFT (8U)
#define LOBS_SIGSELA1_NUM2_SET(x) (((uint32_t)(x) << LOBS_SIGSELA1_NUM2_SHIFT) & LOBS_SIGSELA1_NUM2_MASK)
#define LOBS_SIGSELA1_NUM2_GET(x) (((uint32_t)(x) & LOBS_SIGSELA1_NUM2_MASK) >> LOBS_SIGSELA1_NUM2_SHIFT)

/*
 * NUM1 (RW)
 *
 * Select sample signal bit number1 in first group
 */
#define LOBS_SIGSELA1_NUM1_MASK (0xFFU)
#define LOBS_SIGSELA1_NUM1_SHIFT (0U)
#define LOBS_SIGSELA1_NUM1_SET(x) (((uint32_t)(x) << LOBS_SIGSELA1_NUM1_SHIFT) & LOBS_SIGSELA1_NUM1_MASK)
#define LOBS_SIGSELA1_NUM1_GET(x) (((uint32_t)(x) & LOBS_SIGSELA1_NUM1_MASK) >> LOBS_SIGSELA1_NUM1_SHIFT)

/* Bitfield definition for register: SIGSELA2 */
/*
 * NUM4 (RW)
 *
 * Select sample signal bit number4 in second group
 */
#define LOBS_SIGSELA2_NUM4_MASK (0xFF000000UL)
#define LOBS_SIGSELA2_NUM4_SHIFT (24U)
#define LOBS_SIGSELA2_NUM4_SET(x) (((uint32_t)(x) << LOBS_SIGSELA2_NUM4_SHIFT) & LOBS_SIGSELA2_NUM4_MASK)
#define LOBS_SIGSELA2_NUM4_GET(x) (((uint32_t)(x) & LOBS_SIGSELA2_NUM4_MASK) >> LOBS_SIGSELA2_NUM4_SHIFT)

/*
 * NUM3 (RW)
 *
 * Select sample signal bit number3 in second group
 */
#define LOBS_SIGSELA2_NUM3_MASK (0xFF0000UL)
#define LOBS_SIGSELA2_NUM3_SHIFT (16U)
#define LOBS_SIGSELA2_NUM3_SET(x) (((uint32_t)(x) << LOBS_SIGSELA2_NUM3_SHIFT) & LOBS_SIGSELA2_NUM3_MASK)
#define LOBS_SIGSELA2_NUM3_GET(x) (((uint32_t)(x) & LOBS_SIGSELA2_NUM3_MASK) >> LOBS_SIGSELA2_NUM3_SHIFT)

/*
 * NUM2 (RW)
 *
 * Select sample signal bit number2 in second group
 */
#define LOBS_SIGSELA2_NUM2_MASK (0xFF00U)
#define LOBS_SIGSELA2_NUM2_SHIFT (8U)
#define LOBS_SIGSELA2_NUM2_SET(x) (((uint32_t)(x) << LOBS_SIGSELA2_NUM2_SHIFT) & LOBS_SIGSELA2_NUM2_MASK)
#define LOBS_SIGSELA2_NUM2_GET(x) (((uint32_t)(x) & LOBS_SIGSELA2_NUM2_MASK) >> LOBS_SIGSELA2_NUM2_SHIFT)

