hpmicro/hpm_sdk/soc/HPM6P00/ip/hpm_lobs_regs.h
/* Bitfield definition for register of struct array STATE: SIGMASK */
/*
 * NUM3 (RW)
 *
 * Select compare signal number3
 */
#define LOBS_STATE_SIGMASK_NUM3_MASK (0xFF000000UL)
#define LOBS_STATE_SIGMASK_NUM3_SHIFT (24U)
#define LOBS_STATE_SIGMASK_NUM3_SET(x) (((uint32_t)(x) << LOBS_STATE_SIGMASK_NUM3_SHIFT) & LOBS_STATE_SIGMASK_NUM3_MASK)
#define LOBS_STATE_SIGMASK_NUM3_GET(x) (((uint32_t)(x) & LOBS_STATE_SIGMASK_NUM3_MASK) >> LOBS_STATE_SIGMASK_NUM3_SHIFT)

/*
 * NUM2 (RW)
 *
 * Select compare signal number2
 */
#define LOBS_STATE_SIGMASK_NUM2_MASK (0xFF0000UL)
#define LOBS_STATE_SIGMASK_NUM2_SHIFT (16U)
#define LOBS_STATE_SIGMASK_NUM2_SET(x) (((uint32_t)(x) << LOBS_STATE_SIGMASK_NUM2_SHIFT) & LOBS_STATE_SIGMASK_NUM2_MASK)
#define LOBS_STATE_SIGMASK_NUM2_GET(x) (((uint32_t)(x) & LOBS_STATE_SIGMASK_NUM2_MASK) >> LOBS_STATE_SIGMASK_NUM2_SHIFT)

/*
 * NUM1 (RW)
 *
 * Select compare signal number1
 */
#define LOBS_STATE_SIGMASK_NUM1_MASK (0xFF00U)
#define LOBS_STATE_SIGMASK_NUM1_SHIFT (8U)
#define LOBS_STATE_SIGMASK_NUM1_SET(x) (((uint32_t)(x) << LOBS_STATE_SIGMASK_NUM1_SHIFT) & LOBS_STATE_SIGMASK_NUM1_MASK)
#define LOBS_STATE_SIGMASK_NUM1_GET(x) (((uint32_t)(x) & LOBS_STATE_SIGMASK_NUM1_MASK) >> LOBS_STATE_SIGMASK_NUM1_SHIFT)

/*
 * NUM0 (RW)
 *
 * Select compare signal number0
 */
#define LOBS_STATE_SIGMASK_NUM0_MASK (0xFFU)
#define LOBS_STATE_SIGMASK_NUM0_SHIFT (0U)
#define LOBS_STATE_SIGMASK_NUM0_SET(x) (((uint32_t)(x) << LOBS_STATE_SIGMASK_NUM0_SHIFT) & LOBS_STATE_SIGMASK_NUM0_MASK)
#define LOBS_STATE_SIGMASK_NUM0_GET(x) (((uint32_t)(x) & LOBS_STATE_SIGMASK_NUM0_MASK) >> LOBS_STATE_SIGMASK_NUM0_SHIFT)

/* Bitfield definition for register of struct array STATE: COMPEN */
/*
 * EN (RW)
 *
 * Select compare signal number0-3
 */
#define LOBS_STATE_COMPEN_EN_MASK (0xFU)
#define LOBS_STATE_COMPEN_EN_SHIFT (0U)
#define LOBS_STATE_COMPEN_EN_SET(x) (((uint32_t)(x) << LOBS_STATE_COMPEN_EN_SHIFT) & LOBS_STATE_COMPEN_EN_MASK)
#define LOBS_STATE_COMPEN_EN_GET(x) (((uint32_t)(x) & LOBS_STATE_COMPEN_EN_MASK) >> LOBS_STATE_COMPEN_EN_SHIFT)

/* Bitfield definition for register of struct array STATE: SIGCOMP0 */
/*
 * VALUE0 (RW)
 *
 * Compare golden value for Signal Group signals[31:0].
 */
#define LOBS_STATE_SIGCOMP0_VALUE0_MASK (0xFFFFFFFFUL)
#define LOBS_STATE_SIGCOMP0_VALUE0_SHIFT (0U)
#define LOBS_STATE_SIGCOMP0_VALUE0_SET(x) (((uint32_t)(x) << LOBS_STATE_SIGCOMP0_VALUE0_SHIFT) & LOBS_STATE_SIGCOMP0_VALUE0_MASK)
#define LOBS_STATE_SIGCOMP0_VALUE0_GET(x) (((uint32_t)(x) & LOBS_STATE_SIGCOMP0_VALUE0_MASK) >> LOBS_STATE_SIGCOMP0_VALUE0_SHIFT)

/* Bitfield definition for register of struct array STATE: SIGCOMP1 */
/*
 * VALUE1 (RW)
 *
 * Compare golden value for Signal Group signals[63:32].
 */
#define LOBS_STATE_SIGCOMP1_VALUE1_MASK (0xFFFFFFFFUL)
#define LOBS_STATE_SIGCOMP1_VALUE1_SHIFT (0U)
#define LOBS_STATE_SIGCOMP1_VALUE1_SET(x) (((uint32_t)(x) << LOBS_STATE_SIGCOMP1_VALUE1_SHIFT) & LOBS_STATE_SIGCOMP1_VALUE1_MASK)
#define LOBS_STATE_SIGCOMP1_VALUE1_GET(x) (((uint32_t)(x) & LOBS_STATE_SIGCOMP1_VALUE1_MASK) >> LOBS_STATE_SIGCOMP1_VALUE1_SHIFT)

/* Bitfield definition for register of struct array STATE: SIGCOMP2 */
/*
 * VALUE2 (RW)
 *
 * Compare golden value for Signal Group signals[95:64].
 */
#define LOBS_STATE_SIGCOMP2_VALUE2_MASK (0xFFFFFFFFUL)
#define LOBS_STATE_SIGCOMP2_VALUE2_SHIFT (0U)
#define LOBS_STATE_SIGCOMP2_VALUE2_SET(x) (((uint32_t)(x) << LOBS_STATE_SIGCOMP2_VALUE2_SHIFT) & LOBS_STATE_SIGCOMP2_VALUE2_MASK)
#define LOBS_STATE_SIGCOMP2_VALUE2_GET(x) (((uint32_t)(x) & LOBS_STATE_SIGCOMP2_VALUE2_MASK) >> LOBS_STATE_SIGCOMP2_VALUE2_SHIFT)

/* Bitfield definition for register of struct array STATE: SIGCOMP3 */
/*
 * VALUE3 (RW)
 *
 * Compare golden value for Signal Group signals[127:96].
 */
#define LOBS_STATE_SIGCOMP3_VALUE3_MASK (0xFFFFFFFFUL)
#define LOBS_STATE_SIGCOMP3_VALUE3_SHIFT (0U)
#define LOBS_STATE_SIGCOMP3_VALUE3_SET(x) (((uint32_t)(x) << LOBS_STATE_SIGCOMP3_VALUE3_SHIFT) & LOBS_STATE_SIGCOMP3_VALUE3_MASK)
#define LOBS_STATE_SIGCOMP3_VALUE3_GET(x) (((uint32_t)(x) & LOBS_STATE_SIGCOMP3_VALUE3_MASK) >> LOBS_STATE_SIGCOMP3_VALUE3_SHIFT)

/* Bitfield definition for register: LAR */
/*
 * VALUE (RW)
 *
 * Lock Access Value
 */
#define LOBS_LAR_VALUE_MASK (0xFFFFFFFFUL)
#define LOBS_LAR_VALUE_SHIFT (0U)
#define LOBS_LAR_VALUE_SET(x) (((uint32_t)(x) << LOBS_LAR_VALUE_SHIFT) & LOBS_LAR_VALUE_MASK)
#define LOBS_LAR_VALUE_GET(x) (((uint32_t)(x) & LOBS_LAR_VALUE_MASK) >> LOBS_LAR_VALUE_SHIFT)



/* STATE register group index macro definition */
#define LOBS_STATE_0 (0UL)
#define LOBS_STATE_1 (1UL)
#define LOBS_STATE_2 (2UL)
#define LOBS_STATE_3 (3UL)
#define LOBS_STATE_4 (4UL)


#endif /* HPM_LOBS_H */
